Repository: xcv58/MacTools
Catalog: Plugins/ClipboardHistory/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# saved.variable.case
source: 字母大小写
ar: حالة الأحرف
de: Groß-/Kleinschreibung
en: Letter Case
es: Mayúsculas y minúsculas
fr: Casse
ja: 大文字・小文字
ko: 대소문자
pt: Maiúsculas e minúsculas
ru: Регистр букв
tr: Büyük/Küçük Harf
zh_hant: 字母大小寫

# saved.variable.unchanged
source: 保持不变
ar: دون تغيير
de: Unverändert
en: Unchanged
es: Sin cambios
fr: Inchangée
ja: 変更しない
ko: 변경 안 함
pt: Sem alteração
ru: Без изменений
tr: Değişmez
zh_hant: 保持不變

# saved.variable.upper
source: 大写
ar: أحرف كبيرة
de: GROSSBUCHSTABEN
en: UPPERCASE
es: MAYÚSCULAS
fr: MAJUSCULES
ja: 大文字
ko: 대문자
pt: MAIÚSCULAS
ru: ПРОПИСНЫЕ
tr: BÜYÜK HARF
zh_hant: 大寫

# saved.variable.lower
source: 小写
ar: أحرف صغيرة
de: kleinbuchstaben
en: lowercase
es: minúsculas
fr: minuscules
ja: 小文字
ko: 소문자
pt: minúsculas
ru: строчные
tr: küçük harf
zh_hant: 小寫

# saved.variable.fallback
source: 为空时使用的文本（可选）
ar: نص بديل عند الفراغ (اختياري)
de: Ersatz bei leerem Inhalt (optional)
en: Fallback when empty (optional)
es: Texto si está vacío (opcional)
fr: Texte si vide (facultatif)
ja: 空の場合の代替テキスト（任意）
ko: 비어 있을 때 대체 텍스트(선택 사항)
pt: Texto se vazio (opcional)
ru: Текст при пустом значении (необязательно)
tr: Boşken kullanılacak metin (isteğe bağlı)
zh_hant: 空白時使用的文字（選填）

# saved.variable.empty
source: （空文本）
ar: (نص فارغ)
de: (Leerer Text)
en: (Empty text)
es: (Texto vacío)
fr: (Texte vide)
ja: （空のテキスト）
ko: (빈 텍스트)
pt: (Texto vazio)
ru: (Пустой текст)
tr: (Boş metin)
zh_hant: （空文字）

# saved.variable.formatHelp
source: yyyy 年、MM 月、dd 日；HH 时、mm 分。固定文本用单引号包围。
ar: yyyy = السنة، MM = الشهر، dd = اليوم؛ HH = الساعة، mm = الدقيقة. ضع النص الحرفي بين علامتي اقتباس مفردتين.
de: yyyy = Jahr, MM = Monat, dd = Tag; HH = Stunde, mm = Minute. Festen Text in einfache Anführungszeichen setzen.
en: yyyy = year, MM = month, dd = day; HH = hour, mm = minute. Quote literal text with single quotes.
es: yyyy = año, MM = mes, dd = día; HH = hora, mm = minuto. Usa comillas simples para texto literal.
fr: yyyy = année, MM = mois, dd = jour ; HH = heure, mm = minute. Entourez le texte littéral d’apostrophes.
ja: yyyy = 年、MM = 月、dd = 日、HH = 時、mm = 分。固定テキストは単一引用符で囲みます。
ko: yyyy = 연도, MM = 월, dd = 일, HH = 시, mm = 분. 고정 텍스트는 작은따옴표로 감싸세요.
pt: yyyy = ano, MM = mês, dd = dia; HH = hora, mm = minuto. Use aspas simples para texto literal.
ru: yyyy = год, MM = месяц, dd = день; HH = час, mm = минута. Обычный текст заключайте в одинарные кавычки.
tr: yyyy = yıl, MM = ay, dd = gün; HH = saat, mm = dakika. Sabit metinleri tek tırnak içine alın.
zh_hant: yyyy 年、MM 月、dd 日；HH 時、mm 分。固定文字以單引號括起。

# saved.variable.offsetHelp
source: 可选：+1d 明天，-1w 上周。单位：s 秒、m 分、h 时、d 天、w 周、M 月、y 年。日历偏移会考虑夏令时。
ar: اختياري: +1d غدًا، -1w الأسبوع الماضي. الوحدات: s، m، h، d، w، M للشهر، y. تُراعى تغييرات التوقيت الصيفي.
de: Optional: +1d morgen, -1w letzte Woche. Einheiten: s, m, h, d, w, M (Monat), y. Sommerzeit wird berücksichtigt.
en: Optional: +1d tomorrow, -1w last week. Units: s, m, h, d, w, M (month), y. Calendar offsets respect daylight saving time.
es: Opcional: +1d mañana, -1w semana pasada. Unidades: s, m, h, d, w, M (mes), y. Respeta el horario de verano.
fr: Facultatif : +1d demain, -1w semaine dernière. Unités : s, m, h, d, w, M (mois), y. Tient compte de l’heure d’été.
ja: 任意：+1d は明日、-1w は先週。単位：s 秒、m 分、h 時、d 日、w 週、M 月、y 年。夏時間を考慮します。
ko: 선택 사항: +1d 내일, -1w 지난주. 단위: s 초, m 분, h 시, d 일, w 주, M 월, y 년. 일광 절약 시간을 반영합니다.
pt: Opcional: +1d amanhã, -1w semana passada. Unidades: s, m, h, d, w, M (mês), y. Respeita o horário de verão.
ru: Необязательно: +1d завтра, -1w прошлая неделя. Единицы: s, m, h, d, w, M (месяц), y. Учитывается летнее время.
tr: İsteğe bağlı: +1d yarın, -1w geçen hafta. Birimler: s, m, h, d, w, M (ay), y. Takvim farkları yaz saati uygulamasını dikkate alır.
zh_hant: 選填：+1d 明天，-1w 上週。單位：s 秒、m 分、h 時、d 天、w 週、M 月、y 年。日曆偏移會考慮夏令時間。

# saved.variable.clipboardHelp
source: 使用当前剪贴板文本。先去除空白，再检查是否为空，最后转换大小写。不会将剪贴板文本解析为模板。
ar: يستخدم نص الحافظة الحالي. تُزال الفراغات أولًا ثم يُفحص الفراغ وتُغيَّر حالة الأحرف. لا يُفسَّر النص كقالب.
de: Verwendet den aktuellen Zwischenablagetext. Erst Leerzeichen entfernen, dann auf leeren Inhalt prüfen, zuletzt Schreibweise ändern. Text wird nicht als Vorlage ausgewertet.
en: Uses current clipboard text. Trimming happens before the empty check, then letter case is applied. Clipboard text is never evaluated as a template.
es: Usa el texto actual del portapapeles. Elimina espacios, comprueba si está vacío y aplica la conversión de letras. Nunca interpreta el texto como plantilla.
fr: Utilise le texte actuel du presse-papiers. Supprime les espaces, vérifie si le texte est vide, puis applique la casse. Le texte n’est jamais interprété comme modèle.
ja: 現在のクリップボードのテキストを使用します。空白削除、空判定、大文字・小文字の変換の順に処理します。テキストをテンプレートとして評価しません。
ko: 현재 클립보드 텍스트를 사용합니다. 공백 제거, 빈 값 확인, 대소문자 변환 순으로 처리합니다. 텍스트를 템플릿으로 해석하지 않습니다.
pt: Usa o texto atual da área de transferência. Remove espaços, verifica se está vazio e aplica a conversão de letras. Nunca interpreta o texto como modelo.
ru: Использует текущий текст буфера. Сначала удаляет пробелы, затем проверяет пустоту и меняет регистр. Текст не обрабатывается как шаблон.
tr: Geçerli pano metnini kullanır. Önce boşluklar kırpılır, ardından boş olup olmadığı denetlenir, en son harf büyük/küçük durumu uygulanır. Pano metni asla şablon olarak değerlendirilmez.
zh_hant: 使用目前剪貼簿文字。先移除空白，再檢查是否為空，最後轉換大小寫。不會將剪貼簿文字解析為範本。

# saved.variable.cursorHelp
source: 自动粘贴后将光标放在此处。每个片段仅允许一个标记。仅适用于支持的编辑器；复制文本不会保留光标位置。下方显示其在片段中的位置。
ar: يضع المؤشر هنا بعد اللصق التلقائي. يُسمح بعلامة واحدة فقط. يعمل في المحررات المدعومة؛ النسخ لا يحفظ الموضع. يظهر موضعه في المقتطف أدناه.
de: Setzt den Cursor nach automatischem Einfügen hierher. Nur eine Markierung ist erlaubt. Benötigt einen unterstützten Editor; Kopieren bewahrt die Position nicht. Unten wird die Position angezeigt.
en: Places the typing cursor here after automatic paste. Only one marker is allowed. Works in supported editors; copying text does not preserve cursor position. The line below shows its position in your snippet.
es: Coloca aquí el cursor tras pegar automáticamente. Solo se permite un marcador. Requiere un editor compatible; copiar no conserva la posición. Se muestra debajo.
fr: Place le curseur ici après le collage automatique. Un seul marqueur est autorisé. Nécessite un éditeur compatible ; copier ne conserve pas la position. Sa position est affichée ci-dessous.
ja: 自動貼り付け後にカーソルをここへ移動します。マーカーは1つだけ使用できます。対応エディタで有効です。コピーでは位置は保持されません。下に位置を表示します。
ko: 자동 붙여넣기 후 커서를 여기에 놓습니다. 표시는 하나만 허용됩니다. 지원하는 편집기에서 작동하며 복사 시 위치는 유지되지 않습니다. 아래에 스니펫 내 위치가 표시됩니다.
pt: Coloca o cursor aqui após colar automaticamente. Apenas um marcador é permitido. Requer editor compatível; copiar não preserva a posição. A posição aparece abaixo.
ru: Помещает курсор сюда после автовставки. Допускается один маркер. Нужен совместимый редактор; копирование не сохраняет позицию. Ниже показана позиция в шаблоне.
tr: Otomatik yapıştırmadan sonra yazma imlecini buraya yerleştirir. Yalnızca bir işaretçiye izin verilir. Desteklenen düzenleyicilerde çalışır; metin kopyalamak imleç konumunu korumaz. Aşağıdaki satır, parçacığınızdaki konumunu gösterir.
zh_hant: 自動貼上後將游標放在此處。每個片段僅允許一個標記。僅適用於支援的編輯器；複製文字不會保留游標位置。下方顯示其在片段中的位置。

# settings.advanced.title
source: 高级
ar: متقدم
de: Erweitert
en: Advanced
es: Avanzado
fr: Avancé
ja: 詳細設定
ko: 고급
pt: Avançado
ru: Расширенные настройки
tr: Gelişmiş
zh_hant: 進階

# settings.snippets.manage
source: 管理片段
ar: إدارة المقتطفات
de: Textbausteine verwalten
en: Manage Snippets
es: Gestionar fragmentos
fr: Gérer les extraits
ja: スニペットを管理
ko: 스니펫 관리
pt: Gerir excertos
ru: Управление фрагментами
tr: Parçacıkları Yönet

# panel.color.preview.help
source: 固定中性背景；透明颜色显示棋盘格。预览不会更改复制的颜色。
ar: خلفية محايدة ثابتة؛ تُعرض الألوان الشفافة على نمط رقعة شطرنج. لا تغيّر المعاينة اللون المنسوخ.
de: Fester neutraler Hintergrund; transparente Farben zeigen ein Schachbrettmuster. Die Vorschau verändert die kopierte Farbe nicht.
en: Fixed neutral background; transparent colors show a checkerboard. Previewing does not change the copied color.
es: Fondo neutro fijo; los colores transparentes muestran un patrón de cuadros. La vista previa no modifica el color copiado.
fr: Fond neutre fixe ; les couleurs transparentes affichent un damier. L’aperçu ne modifie pas la couleur copiée.
ja: 背景は固定の中間色です。透明な色には市松模様を表示します。プレビューはコピーした色を変更しません。
ko: 고정된 중성 배경이며 투명한 색상에는 바둑판무늬가 표시됩니다. 미리보기는 복사한 색상을 변경하지 않습니다.
pt: Fundo neutro fixo; cores transparentes mostram um padrão quadriculado. A pré-visualização não altera a cor copiada.
ru: Постоянный нейтральный фон; прозрачные цвета показаны на шахматном фоне. Предпросмотр не меняет скопированный цвет.
tr: Sabit nötr arka plan; saydam renkler dama deseni gösterir. Önizleme, kopyalanan rengi değiştirmez.
zh_hant: 固定中性背景；透明顏色顯示棋盤格。預覽不會更改複製的顏色。

# panel.selection.clear
source: 取消选择
ar: إلغاء التحديد
de: Auswahl aufheben
en: Clear Selection
es: Borrar selección
fr: Effacer la sélection
ja: 選択を解除
ko: 선택 해제
pt: Limpar seleção
ru: Снять выделение
tr: Seçimi Temizle
zh_hant: 取消選取

# panel.selection.all
source: 选择所有可见项
ar: تحديد كل العناصر الظاهرة
de: Alle sichtbaren auswählen
en: Select All Visible
es: Seleccionar todos los visibles
fr: Tout sélectionner à l’écran
ja: 表示中の項目をすべて選択
ko: 표시된 항목 모두 선택
pt: Selecionar todos os visíveis
ru: Выбрать все видимые
tr: Tüm Görünenleri Seç
zh_hant: 選取所有可見項目

# panel.selection.select
source: 选择
ar: تحديد
de: Auswählen
en: Select
es: Seleccionar
fr: Sélectionner
ja: 選択
ko: 선택
pt: Selecionar
ru: Выбрать
tr: Seç
zh_hant: 選取

# panel.selection.order
source: 按选择顺序合并项目。
ar: تُدمج العناصر حسب ترتيب التحديد.
de: Elemente werden in Auswahlreihenfolge kombiniert.
en: Items are combined in selection order.
es: Los elementos se combinan en el orden de selección.
fr: Les éléments sont combinés dans l’ordre de sélection.
ja: 選択した順に項目を結合します。
ko: 선택한 순서대로 항목을 결합합니다.
pt: Os itens são combinados na ordem de seleção.
ru: Элементы объединяются в порядке выбора.
tr: Öğeler seçim sırasına göre birleştirilir.
zh_hant: 依選取順序合併項目。

# panel.selection.delete.action
source: 删除所选项目（%lld）…
ar: حذف التحديد (%lld)…
de: Auswahl löschen (%lld)…
en: Delete Selection (%lld)…
es: Eliminar selección (%lld)…
fr: Supprimer la sélection (%lld)…
ja: 選択項目を削除（%lld件）…
ko: 선택 항목 삭제(%lld개)…
pt: Apagar seleção (%lld)…
ru: Удалить выбранное (%lld)…
tr: Seçimi Sil (%lld)…
zh_hant: 刪除所選項目（%lld）…

# panel.selection.delete.message
source: 所选项目将被永久删除，包括已保存的副本或片段。此操作无法撤销。
ar: ستُحذف العناصر المحددة نهائيًا، بما في ذلك النسخ المحفوظة أو المقتطفات. لا يمكن التراجع عن هذا الإجراء.
de: Die ausgewählten Elemente werden einschließlich gespeicherter Kopien oder Textbausteine dauerhaft gelöscht. Dies kann nicht widerrufen werden.
en: The selected items will be permanently deleted, including saved copies or snippets. This can’t be undone.
es: Los elementos seleccionados se eliminarán permanentemente, incluidas las copias guardadas o los fragmentos. Esta acción no se puede deshacer.
fr: Les éléments sélectionnés seront définitivement supprimés, y compris les copies enregistrées ou les extraits. Cette action est irréversible.
ja: 保存済みのコピーやスニペットを含む選択項目が完全に削除されます。この操作は取り消せません。
ko: 저장된 복사본 또는 스니펫을 포함한 선택 항목이 영구적으로 삭제됩니다. 이 작업은 취소할 수 없습니다.
pt: Os itens selecionados serão apagados permanentemente, incluindo cópias guardadas ou trechos. Esta ação não pode ser desfeita.
ru: Выбранные элементы, включая сохранённые копии и фрагменты, будут удалены навсегда. Это действие нельзя отменить.
tr: Seçili öğeler, kayıtlı kopyalar veya parçacıklar dahil kalıcı olarak silinecek. Bu işlem geri alınamaz.
zh_hant: 所選項目將被永久刪除，包括已儲存的副本或片段。此操作無法還原。

# panel.selection.delete.title
source: 永久删除所选项目（%lld）？
ar: حذف التحديد نهائيًا (%lld)؟
de: Auswahl dauerhaft löschen (%lld)?
en: Permanently Delete Selection (%lld)?
es: ¿Eliminar permanentemente la selección (%lld)?
fr: Supprimer définitivement la sélection (%lld) ?
ja: 選択項目を完全に削除しますか（%lld件）？
ko: 선택 항목을 영구적으로 삭제할까요(%lld개)?
pt: Apagar permanentemente a seleção (%lld)?
ru: Удалить выбранное навсегда (%lld)?
tr: Seçim (%lld) Kalıcı Olarak Silinsin Mi?
zh_hant: 永久刪除所選項目（%lld）？

# panel.selection.orderedCount
source: 已选 %lld 项 · 按选择顺序
ar: تم تحديد %lld · ترتيب التحديد
de: %lld ausgewählt · Auswahlreihenfolge
en: %lld selected · Selection order
es: %lld seleccionados · Orden de selección
fr: %lld sélectionnés · Ordre de sélection
ja: %lld 件選択 · 選択順
ko: %lld개 선택 · 선택 순서
pt: %lld selecionados · Ordem de seleção
ru: Выбрано: %lld · Порядок выбора
tr: %lld seçili · Seçim sırası
zh_hant: 已選 %lld 項 · 依選取順序

# panel.selection.orderedCountMaximum
source: 已选 %lld 项 · 已达上限 · 按选择顺序
ar: تم تحديد %lld · الحد الأقصى · ترتيب التحديد
de: %lld ausgewählt · Maximum · Auswahlreihenfolge
en: %lld selected · Maximum · Selection order
es: %lld seleccionados · Máximo · Orden de selección
fr: %lld sélectionnés · Maximum · Ordre de sélection
ja: %lld 件選択 · 上限 · 選択順
ko: %lld개 선택 · 최대 · 선택 순서
pt: %lld selecionados · Máximo · Ordem de seleção
ru: Выбрано: %lld · Максимум · Порядок выбора
tr: %lld seçili · En fazla · Seçim sırası
zh_hant: 已選 %lld 項 · 已達上限 · 依選取順序

# panel.selection.limitReached
source: 最多可选择 %lld 项。
ar: يمكنك تحديد ما يصل إلى %lld عنصرًا.
de: Du kannst bis zu %lld Elemente auswählen.
en: You can select up to %lld items.
es: Puedes seleccionar hasta %lld elementos.
fr: Vous pouvez sélectionner jusqu’à %lld éléments.
ja: 選択できる項目は最大 %lld 件です。
ko: 최대 %lld개 항목을 선택할 수 있습니다.
pt: Pode selecionar até %lld itens.
ru: Можно выбрать не более %lld элементов.
tr: En fazla %lld öğe seçebilirsiniz.
zh_hant: 最多可選取 %lld 項。

# panel.selection.position
source: 所选项目中的第 %lld 项，共 %lld 项
ar: الموضع %lld من %lld في التحديد
de: Position %lld von %lld in der Auswahl
en: Position %lld of %lld in selection
es: Posición %lld de %lld en la selección
fr: Position %lld sur %lld dans la sélection
ja: 選択項目の %lld 番目（全 %lld 件）
ko: 선택 항목 중 %lld번째, 총 %lld개
pt: Posição %lld de %lld na seleção
ru: Позиция %lld из %lld в выборе
tr: Seçimdeki konum: %lld / %lld
zh_hant: 所選項目中的第 %lld 項，共 %lld 項

# panel.selection.preview
source: 预览：%@ · 操作应用于所选项目
ar: معاينة: %@ · تُطبّق الإجراءات على التحديد
de: Vorschau: %@ · Aktionen gelten für die Auswahl
en: Preview: %@ · Actions use the selection
es: Vista previa: %@ · Las acciones usan la selección
fr: Aperçu : %@ · Les actions concernent la sélection
ja: プレビュー：%@ · 操作は選択項目に適用
ko: 미리 보기: %@ · 동작은 선택 항목에 적용
pt: Prévia: %@ · As ações usam a seleção
ru: Просмотр: %@ · Действия применяются к выделению
tr: Önizleme: %@ · Eylemler seçimi kullanır
zh_hant: 預覽：%@ · 操作套用至所選項目

# panel.selection.shareCount
source: 共享 %lld 项
ar: مشاركة %lld
de: %lld teilen
en: Share %lld
es: Compartir %lld
fr: Partager %lld
ja: %lld 件を共有
ko: %lld개 공유
pt: Compartilhar %lld
ru: Поделиться: %lld
tr: %lld Öğeyi Paylaş
zh_hant: 分享 %lld 項

# panel.selection.pasteCount
source: 粘贴 %lld 项
ar: لصق %lld
de: %lld einsetzen
en: Paste %lld
es: Pegar %lld
fr: Coller %lld
ja: %lld 件をペースト
ko: %lld개 붙여넣기
pt: Colar %lld
ru: Вставить: %lld
tr: %lld Öğeyi Yapıştır
zh_hant: 貼上 %lld 項

# snippet.templatePreview
source: 模板预览
ar: معاينة القالب
de: Vorlagenvorschau
en: Template Preview
es: Vista previa de plantilla
fr: Aperçu du modèle
ja: テンプレートのプレビュー
ko: 템플릿 미리 보기
pt: Prévia do modelo
ru: Просмотр шаблона
tr: Şablon Önizlemesi
zh_hant: 範本預覽

# panel.shortcuts.guide
source: 快捷键
ar: الاختصارات
de: Kurzbefehle
en: Shortcuts
es: Atajos
fr: Raccourcis
ja: ショートカット
ko: 단축키
pt: Atalhos
ru: Сочетания клавиш
tr: Kısayollar
zh_hant: 快速鍵

# export.action.named
source: 导出为 %@
ar: تصدير بتنسيق %@
de: Als %@ exportieren
en: Export as %@
es: Exportar como %@
fr: Exporter en %@
ja: %@ として書き出す
ko: %@ 형식으로 내보내기
pt: Exportar como %@
ru: Экспортировать как %@
tr: %@ Olarak Dışa Aktar
zh_hant: 匯出為 %@

# panel.shortcuts.editSnippet.description
source: 剪贴板窗口处于前台时，编辑选中的片段。
ar: عدّل المقتطف المحدد عندما تكون نافذة الحافظة نشطة.
de: Bearbeite das ausgewählte Snippet, wenn das Zwischenablagefenster fokussiert ist.
en: Edit the selected snippet while the Clipboard window is focused.
es: Edita el fragmento seleccionado cuando la ventana del portapapeles tenga el foco.
fr: Modifiez l’extrait sélectionné lorsque la fenêtre du presse-papiers est active.
ja: クリップボードウインドウがアクティブなときに、選択したスニペットを編集します。
ko: 클립보드 윈도우에 초점이 있을 때 선택한 스니펫을 편집합니다.
pt: Edite o trecho selecionado quando a janela da Área de Transferência estiver em foco.
ru: Редактировать выбранный фрагмент, когда окно буфера обмена активно.
tr: Pano penceresi odaktayken seçili parçacığı düzenler.
zh_hant: 剪貼簿視窗位於前景時，編輯所選片段。

# panel.filter.family.type
source: 类型
ar: النوع
de: Typ
en: Type
es: Tipo
fr: Type
ja: 種類
ko: 유형
pt: Tipo
ru: Тип
tr: Tür
zh_hant: 類型

# panel.filter.family.content
source: 内容
ar: المحتوى
de: Inhalt
en: Content
es: Contenido
fr: Contenu
ko: 내용
pt: Conteúdo
ru: Содержимое
tr: İçerik
zh_hant: 內容

# panel.footer.moreShortcuts
source: 更多快捷键
ar: المزيد من الاختصارات
de: Weitere Kurzbefehle
en: More Shortcuts
es: Más atajos
fr: Plus de raccourcis
ja: その他のショートカット
ko: 더 많은 단축키
pt: Mais atalhos
ru: Другие сочетания клавиш
tr: Daha Fazla Kısayol
zh_hant: 更多快速鍵

# panel.selection.toggleFocused
source: 勾选或取消勾选
ar: تحديد العنصر أو إلغاء تحديده
de: Objekt markieren oder abwählen
en: Mark or Unmark Item
es: Marcar o desmarcar elemento
fr: Cocher ou décocher l’élément
ja: 項目の選択を切り替える
ko: 항목 선택 또는 선택 해제
pt: Marcar ou desmarcar item
ru: Отметить или снять отметку
tr: Öğeyi İşaretle veya İşareti Kaldır
zh_hant: 勾選或取消勾選

# panel.selection.selectAll
source: 全选可见项
ar: تحديد كل العناصر الظاهرة
de: Alle sichtbaren Objekte auswählen
en: Select All Visible
es: Seleccionar todos los visibles
fr: Tout sélectionner dans la liste
ja: 表示中の項目をすべて選択
ko: 표시된 항목 모두 선택
pt: Selecionar todos os visíveis
ru: Выбрать все видимые
tr: Tüm Görünenleri Seç
zh_hant: 全選可見項目

# panel.shortcuts.selectAll.description
source: 在多选模式中全选当前显示的项目，同时保持搜索栏焦点。
ar: في وضع التحديد المتعدد، حدّد كل العناصر المعروضة من دون نقل التركيز من البحث.
de: Wählt im Mehrfachauswahlmodus alle sichtbaren Objekte aus, ohne den Suchfokus zu ändern.
en: In multi-select mode, select every item currently shown without taking focus from search.
es: En el modo de selección múltiple, selecciona todos los elementos visibles sin quitar el foco de la búsqueda.
fr: En mode de sélection multiple, sélectionnez tous les éléments visibles sans quitter la recherche.
ja: 複数選択モードで、検索からフォーカスを移さずに表示中の項目をすべて選択します。
ko: 다중 선택 모드에서 검색 포커스를 유지한 채 현재 표시된 모든 항목을 선택합니다.
pt: No modo de seleção múltipla, seleciona todos os itens visíveis sem retirar o foco da pesquisa.
ru: В режиме множественного выбора выбирает все видимые элементы, не снимая фокус с поиска.
tr: Çoklu seçim modunda, arama alanından odağı almadan o an görünen tüm öğeleri seçer.
zh_hant: 在多選模式中全選目前顯示的項目，同時保留搜尋列焦點。

# panel.selection.extend
source: 扩展选择
ar: توسيع التحديد
de: Auswahl erweitern
en: Extend Selection
es: Ampliar selección
fr: Étendre la sélection
ja: 選択範囲を拡張
ko: 선택 확장
pt: Estender seleção
ru: Расширить выделение
tr: Seçimi Genişlet
zh_hant: 延伸選取

# saved.keyword.disabled
source: 关键词展开已关闭。你仍可手动粘贴此片段。
ar: توسيع الكلمات معطّل. لا يزال بإمكانك لصق هذا المقتطف يدويًا.
de: Die Kürzelexpansion ist aus. Du kannst dieses Snippet weiterhin manuell einfügen.
en: Keyword expansion is off. You can still paste this snippet manually.
es: La expansión de palabras clave está desactivada. Puedes pegar este fragmento manualmente.
fr: L’expansion des mots-clés est désactivée. Vous pouvez toujours coller cet extrait manuellement.
ja: キーワード展開はオフです。このスニペットは手動で貼り付けられます。
ko: 키워드 확장이 꺼져 있습니다. 이 스니펫을 수동으로 붙여넣을 수 있습니다.
pt: A expansão de palavras-chave está desativada. Ainda pode colar este trecho manualmente.
ru: Раскрытие ключевых слов выключено. Этот фрагмент можно вставить вручную.
tr: Anahtar sözcük genişletmesi kapalı. Bu parçacığı yine de el ile yapıştırabilirsiniz.
zh_hant: 關鍵字展開已關閉。你仍可手動貼上此片段。

# saved.keyword.enable
source: 启用
ar: تفعيل
de: Aktivieren
en: Enable
es: Activar
fr: Activer
ja: 有効にする
ko: 활성화
pt: Ativar
ru: Включить
tr: Etkinleştir
zh_hant: 啟用

# settings.saved.expansion.status.listening
source: 监听中
ar: جارٍ الاستماع
de: Lauscht
en: Listening
es: Escuchando
fr: À l’écoute
ja: 入力を監視中
ko: 입력 감지 중
pt: A ouvir
ru: Ожидание ввода
tr: Dinliyor
zh_hant: 監聽中

# settings.expansion.focusOwnershipUnverified
source: 已找到当前编辑器，但无法确认其所属应用窗口。请改用剪贴板粘贴片段。
ar: تم العثور على المحرر النشط، لكن تعذّر التحقق من نافذة تطبيقه. الصق المقتطف من الحافظة بدلًا من ذلك.
de: Der fokussierte Editor wurde gefunden, aber sein App-Fenster konnte nicht bestätigt werden. Füge das Snippet stattdessen aus der Zwischenablage ein.
en: The focused editor was found, but its app window could not be verified. Paste the snippet from Clipboard instead.
es: Se encontró el editor enfocado, pero no se pudo verificar su ventana. Pega el fragmento desde el Portapapeles.
fr: L’éditeur actif a été trouvé, mais sa fenêtre n’a pas pu être vérifiée. Collez plutôt l’extrait depuis le Presse-papiers.
ja: 入力中のエディタは見つかりましたが、アプリのウインドウを確認できませんでした。クリップボードからスニペットを貼り付けてください。
ko: 포커스된 편집기를 찾았지만 앱 창을 확인할 수 없습니다. 클립보드에서 스니펫을 붙여넣으세요.
pt: O editor em foco foi encontrado, mas não foi possível verificar a janela da aplicação. Cole o trecho pela Área de Transferência.
ru: Редактор найден, но его окно приложения не удалось проверить. Вставьте фрагмент через Буфер обмена.
tr: Odaktaki düzenleyici bulundu, ancak uygulama penceresi doğrulanamadı. Bunun yerine parçacığı Panodan yapıştırın.
zh_hant: 已找到目前的編輯器，但無法確認其所屬 App 視窗。請改用剪貼簿貼上片段。

# settings.expansion.focusUnavailable
source: 无法访问当前编辑器，请重新输入关键词。
ar: تعذّر الوصول إلى المحرر النشط. حاول كتابة الكلمة المفتاحية مجددًا.
de: Der aktive Editor konnte nicht erreicht werden. Gib das Schlüsselwort erneut ein.
en: The focused editor could not be reached. Try typing the keyword again.
es: No se pudo acceder al editor activo. Vuelve a escribir la palabra clave.
fr: L’éditeur actif est inaccessible. Réessayez de saisir le mot-clé.
ja: 入力中のエディタにアクセスできませんでした。キーワードをもう一度入力してください。
ko: 활성 편집기에 접근할 수 없습니다. 키워드를 다시 입력해 보세요.
pt: Não foi possível aceder ao editor ativo. Tente digitar a palavra-chave novamente.
ru: Не удалось получить доступ к активному редактору. Введите ключевое слово ещё раз.
tr: Odaktaki düzenleyiciye erişilemedi. Anahtar sözcüğü yeniden yazmayı deneyin.
zh_hant: 無法存取目前的編輯器，請重新輸入關鍵字。

# settings.snippets.section
source: 片段
ar: المقتطفات
de: Textbausteine
en: Snippets
es: Fragmentos
fr: Extraits
ja: スニペット
ko: 스니펫
pt: Trechos
ru: Шаблоны
tr: Parçacıklar

# settings.expansion.listening
source: 等待在其他应用中输入。
ar: بانتظار الكتابة في تطبيق آخر.
de: Warte auf Eingabe in einer anderen App.
en: Waiting for typing in another app.
es: Esperando que escribas en otra app.
fr: En attente de saisie dans une autre app.
ja: 別のアプリでの入力を待機中。
ko: 다른 앱에서 입력을 기다리는 중입니다.
pt: A aguardar digitação noutra app.
ru: Ожидание ввода в другом приложении.
tr: Başka bir uygulamada yazma bekleniyor.
zh_hant: 等待在其他 App 中輸入。

# settings.expansion.receiving
source: 正在等待已配置的关键词。
ar: بانتظار كلمة مفتاحية مُعدّة.
de: Warte auf ein konfiguriertes Schlüsselwort.
en: Listening for a configured keyword.
es: Esperando una palabra clave configurada.
fr: En attente d’un mot-clé configuré.
ja: 設定したキーワードを待機中。
ko: 설정된 키워드를 기다리는 중입니다.
pt: A aguardar uma palavra-chave configurada.
ru: Ожидание настроенного ключевого слова.
tr: Yapılandırılmış bir anahtar sözcük dinleniyor.
zh_hant: 正在等待已設定的關鍵字。

# settings.expansion.expanded
source: 上次关键词展开成功。
ar: تم توسيع آخر كلمة مفتاحية بنجاح.
de: Letztes Schlüsselwort erfolgreich erweitert.
en: Last keyword expanded successfully.
es: La última palabra clave se expandió correctamente.
fr: Le dernier mot-clé a été développé.
ja: 最後のキーワードを展開しました。
ko: 마지막 키워드가 확장되었습니다.
pt: A última palavra-chave foi expandida.
ru: Последнее ключевое слово успешно подставлено.
tr: Son anahtar sözcük başarıyla genişletildi.
zh_hant: 上次關鍵字展開成功。
